soap-tests/requests/get-movies.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:ser="http://service.cinematicketsoap.cinema.soap.org/">
   <soapenv:Header/>
   <soapenv:Body>
      <ser:GetMovies/>
   </soapenv:Body>
</soapenv:Envelope>
